Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The "perf" argument is used to instruct this new instance to perform the create event or not.
zh_cn: "perf"参数用于指示这个新实例是否执行create事件。

source: The "size" is the size of the buffer (in bytes) that you wish to fill, while the offset is the offset value (also in bytes) from the start of the buffer to start the fill from.
zh_cn: "size"是您希望填充的缓冲区的大小(以字节为单位)，而offset是从开始填充的缓冲区开始的偏移值(也以字节为单位)。

source: The "surface_id" is that of a surface you have created previously, or the application_suface, and the function will resize that surface.
zh_cn: "surface_id"是您之前创建的表面或application_surface的表面，此函数将调整该表面的大小。

source: The "target" parameter that you specify is the same as the standard JavaScript "name" value when you use the open() method (be aware that all but "_self" may result in the browser blocking, or asking the user if they wish to allow it) and the "options" is the same as the JavaScript "specs" parameter for controlling what properties the new window/tab should display (not all browsers may support all features).
zh_cn: 当你使用open()方法时，你指定的"target"参数与标准的JavaScript "name"值相同(注意除了"_self"可能导致浏览器阻塞，或询问用户是否允许)，而"options"与JavaScript "specs"参数相同，用于控制新窗口/选项卡应该显示什么属性(并非所有浏览器都可能支持所有功能)。

source: The "target" parameter that you specify is the same as the standard JavaScript "name" value when you use the open() method, and you should be aware that all but "_self" may result in the browser blocking, or asking the user if they wish to allow it.
zh_cn: 当您使用open()方法时，指定的"target"参数与标准JavaScript"name"值相同，您应该注意，除了"_self"之外的所有参数都可能导致浏览器阻塞，或者询问用户是否希望允许它。

source: The (previously created) DS map that stores the bone data.
zh_cn: 存储骨骼数据的(先前创建的)DS 映射。

source: The (previously created) buffer to use to store the data.
zh_cn: (以前创建的)用于存储数据的缓冲区。

source: The ARGB value to set.
zh_cn: 要设置的ARGB值。

source: The Android SYSTEM flags to use (as an integer value).
zh_cn: 要使用的Android系统标志(作为整数值)。

source: The DS Map ID to use.
zh_cn: 要使用的DS Map ID。

source: The DS grid cells will contain the value -1 if the MP grid cell was flagged as occupied, or it will be 0 if not.
zh_cn: 如果MP网格单元被标记为被占用，则DS网格单元将包含值-1，否则将为0。

source: The DS grid must have been created previously (see the example below).
zh_cn: DS网格必须在以前创建过(参见下面的示例)。

source: The DS grid should be the same size as the MP grid, although it doesn't have to be (data will be lost if it is smaller, and if it is larger all extra grid cells will be 0).
zh_cn: DS网格应该与MP网格大小相同，尽管这不是必须的(如果它更小，数据将丢失，如果它更大，所有额外的网格单元将为0)。

source: The DS list to use to store the IDs of colliding instances.
zh_cn: 用于存储碰撞实例id的DS列表。

source: The DS map ID value.
zh_cn: DS mapID值。

source: The DS map to use as async_load in the called event.
zh_cn: DS map在被调用的事件中用作async_load。

source: The FX struct to get the name of
zh_cn: 要创建的过滤器/效果的名称(作为字符串)。

source: The FX struct to get the parameter from
zh_cn: 用于从中获取参数的FX结构

source: The FX struct to get the parameter names of
zh_cn: 要获取名称的FX结构

source: The FX struct to modify
zh_cn: 要修改的FX结构

source: The File ID is the value returned by the function file_bin_open().
zh_cn: 文件ID是函数file_bin_open()返回的值。

source: The GPU state to set as a DS Map.
zh_cn: GPU状态设置为一个DS Map。

source: The ID of gif to add the surface data to
zh_cn: 要添加表面数据的gif的ID

source: The ID of gif to save
zh_cn: 要保存的gif的ID

source: The ID of surface to be copied.
zh_cn: 要复制的表面的ID。

source: The ID of the DS list to populate with the DS maps.
zh_cn: 要用DS map填充的DS列表的ID。

source: The ID of the DS list to populate with the animation names.
zh_cn: 要用动画名称填充的DS列表的ID。

source: The ID of the DS list to populate with the bone names.
zh_cn: 要用骨骼名称填充的DS列表的ID。

source: The ID of the array to copy from.
zh_cn: 要从中复制的数组的ID。

source: The ID of the array to copy to.
zh_cn: 要复制到的数组的ID。

source: The ID of the buffer to use.
zh_cn: 要使用的缓冲区的ID。

source: The ID of the file to close.
zh_cn: 要关闭的文件ID。

source: The ID of the file to get the data from.
zh_cn: 要从中获取数据的文件的ID。

source: The ID of the file to get the position in.
zh_cn: 要在其中获取位置的文件的ID。

source: The ID of the file to get the size of.
zh_cn: 要获取其大小的文件的ID。

source: The ID of the file to read from.
zh_cn: 要读取的文件的ID。

source: The ID of the file to rewrite.
zh_cn: 要重写的文件的ID。

source: The ID of the file to write to.
zh_cn: 要写入的文件的ID。

source: The ID of the fixture that is to be removed from the instance
zh_cn: 要从实例中删除的夹具的ID

source: The ID of the function to use
zh_cn: 要使用的函数的ID

source: The ID of the instance to remove the fixture from
zh_cn: 要从中删除夹具的实例的ID

source: The ID of the notification to cancel.
zh_cn: 要取消的通知的ID。

source: The ID of the surface to be copied.
zh_cn: 要复制的表面的ID。

source: The ID of the surface to be freed.
zh_cn: 要释放的表面的ID。

source: The ID of the surface to change.
zh_cn: 要改变的表面的ID。

source: The ID of the surface to check.
zh_cn: 要检查的表面的ID。

source: The ID of the surface to copy the other surface to.
zh_cn: 要将另一个表面复制到的表面的ID。

source: The ID of the surface to get the height of.
zh_cn: 要得到高度的表面的ID。

source: The ID of the surface to get the width of.
zh_cn: 要得到宽度的表面的ID。

source: The ID of the surface to set as the drawing target.
zh_cn: 要设置为绘图目标的表面的ID。

source: The ID of the surface to use as the added frame
zh_cn: 要用作添加帧的表面ID

source: The ID of the surface to use.
zh_cn: 要使用的表面的ID。

source: The ID of the surface.
zh_cn: 表面的ID。

source: The ID of the tile set to use
zh_cn: 要使用的图块集的ID

source: The ID or struct pointer of the animation curve to target
zh_cn: 指向目标动画曲线的ID或结构指针

source: The JSON format string that you are passing to the function for decoding
zh_cn: 传递给函数进行解码的JSON格式字符串

source: The JSON to parse (a string)
zh_cn: 要解析的JSON(字符串)

source: The Nine Slice struct to apply
zh_cn: 要应用的九宫格结构

source: The ORIGINAL queue to copy to id.
zh_cn: 要复制到id的原始队列。

source: The ORIGINAL stack to copy to id.
zh_cn: 要复制到id的原始堆栈。

source: The URL (website address) to link to, or the script to be run.
zh_cn: 要链接到的URL(网站地址)，或要运行的脚本。

source: The URL (website address) to link to.
zh_cn: 要链接到的URL(网址)。

source: The URL or IP to connect to (a string).
zh_cn: 要连接的URL或IP(字符串)。

source: The URL to get the IP of (a string).
zh_cn: 获取IP的URL(字符串)。

source: The URL to the avatar associated with this player in Opera GX, for rollback networking.
zh_cn: 在Opera GX中与此玩家相关联的头像的URL，用于回滚联网。

source: The Unicode code value to get the string from
zh_cn: 要从中获取字符串的Unicode代码值

source: The X position to move the sequence element to
zh_cn: 将序列元素移动到的X位置

source: The Y position to move the sequence element to
zh_cn: 序列元素要移动到的Y位置

source: The actual contents of the DS map will depend on the type of gesture event that triggered it, so refer to the individual sections for those events.
zh_cn: DS map的实际内容将取决于触发它的手势事件的类型，因此请参考这些事件的各个部分。

source: The actual correlation between degrees of tilt and the value returned depends on the device and OS that it uses, but generally a value of 1 or -1 is the same as +/-90°.
zh_cn: 倾斜程度和返回值之间的实际相关性取决于设备和它所使用的操作系统，但一般情况下，1或-1的值等同于+/-90°。

source: The actual position of the points remains the same, only the order in which they are processed is changed.
zh_cn: 这些点的实际位置保持不变，只是它们被处理的顺序改变了。

source: The actual return value will depend on the platform and the internal configuration of that platform and as such this function should be used in conjunction with the function gamepad_is_connected() to make sure of the exact number of pads connected at any time.
zh_cn: 实际返回值将取决于平台和该平台的内部配置，因此此函数应该与函数gamepad_is_connected()一起使用，以确保在任何时候连接的pad的确切数量。

source: The added direction.
zh_cn: 增加的方向。

source: The added speed.
zh_cn: 增加的速度。

source: The alarm index to get, from 0 to 11.
zh_cn: 要获取的告警索引，从0到11。

source: The alarm index to set, from 0 to 11.
zh_cn: 设置的告警索引，取值范围为0 ~ 11。

source: The alpha for background sprite, from 0 to 1 (default is 1)
zh_cn: 背景精灵的alpha，从0到1(默认为1)

source: The alpha for sprite sprite, from 0 to 1 (default is 1)
zh_cn: 精灵的透明度(Alpha)值，从0到1(默认值是1)

source: The alpha for the text.
zh_cn: 文本的透明度。

source: The alpha of the particle.
zh_cn: 粒子的alpha(透明度)。

source: The alpha of the sprite (from 0 to 1 where 0 is transparent and 1 opaque).
zh_cn: 精灵的透明度(Alpha)值 (从0到1，0是透明的，1是不透明的)。

source: The alpha of the surface.
zh_cn: 表面的alpha。

source: The alpha to draw this vertex with (0-1).
zh_cn: 用 (0-1) 绘制此顶点的 alpha。

source: The alpha to set (between 0 and 1)
zh_cn: 要设置的透明度(Alpha)值(介于0和1之间)

source: The alpha to set from 0 to 1.
zh_cn: 要设置的alpha,从0到1。

source: The alpha transparency for drawing the surface.
zh_cn: 绘制表面的 alpha 透明度。

source: The alpha transparency the part should be drawn with.
zh_cn: 绘制部分时应使用的alpha透明度。

source: The alpha transparency to draw the surface with..
zh_cn: 用于绘制表面的alpha透明度..

source: The alpha value for the vertex (from 0 to 1).
zh_cn: 顶点的透明度(Alpha)值(从0到1)。

source: The alpha value to use (from 0 to 1).
zh_cn: 要使用的透明度(Alpha)值(从0到1)。

source: The alpha value to use when drawing (0 - 1).
zh_cn: 绘图时使用的透明度(Alpha)值(0 - 1)。

source: The alpha with which to blend the surface.
zh_cn: 用于混合表面的alpha。

source: The amount of AA used will depend on the value set using the function draw_set_swf_aa_level().
zh_cn: 使用的 AA 数量取决于使用函数 draw_set_swf_aa_level() 设置的值。

source: The amount of each of the component colours can be defined by changing the "amount" argument, where a value of 0 will return the first colour (col1), a value of 1 will return the second colour (col2) and a value in between will return the corresponding mix.
zh_cn: 可以通过更改"amount"参数来定义每种成分颜色的数量，其中值0将返回第一种颜色(col1)，值1将返回第二种颜色(col2)，介于两者之间的值将返回相应的混合色。

source: The amount of vibration from the left motor from 0 to 1.
zh_cn: 左马达的振动量从0到1。

source: The amount of vibration from the right motor from 0 to 1.
zh_cn: 右马达的振动量从0到1。

source: The amount the angle wiggles clockwise/counterclockwise per step.
zh_cn: 角度每步顺时针/逆时针摆动的量。

source: The amount to interpolate.
zh_cn: 要插值的量。

source: The angle (in degrees) to draw the sprite at.
zh_cn: 绘制精灵的角度(以度为单位)。

source: The angle (in degrees) to return the cosine of.
zh_cn: 要返回余弦值的角度(以度为单位)。

source: The angle (in degrees) to return the sine of.
zh_cn: 要返回其正弦值的角度(以度为单位)。

source: The angle (in degrees) to return the tangent of.
zh_cn: 要返回正切值的角度(以度为单位)。

source: The angle (in degrees) to rotate the group to on create.
zh_cn: 创建时旋转组的角度(以度为单位)。

source: The angle (in radians) to return the cosine of.
zh_cn: 要返回余弦值的角度(以弧度为单位)。

source: The angle (in radians) to return the inverse cosine of.
zh_cn: 返回的反余弦的角度(以弧度为单位)。

source: The angle (in radians) to return the inverse tangent of.
zh_cn: 要返回其反正切值的角度(以弧度为单位)。

source: The angle (in radians) to return the sine of.
zh_cn: 要返回正弦值的角度(以弧度为单位)。

source: The angle (in radians) to return the tangent of.
zh_cn: 要返回正切值的角度(以弧度为单位)。

source: The angle is measured in degrees and has a default value of 45°.
zh_cn: 角度以度为单位，默认值为45度。

source: The angle is measured in degrees and has a default value of 5°.
zh_cn: 角度以度为单位，默认值为5度。

source: The angle of rotation degrees.
zh_cn: 旋转的角度度数。

source: The angle of the field of view.
zh_cn: 视场野的角度。

source: The angle of the sprite (default is 0)
zh_cn: 精灵的角度(默认为0)

source: The angle of the text.
zh_cn: 文本的角度。

source: The angle that a line between the two anchor points of the joint makes.
zh_cn: 关节的两个锚点之间的连线所成的角度。

source: The angle to check (of the calling instance)
zh_cn: (调用实例的)要检查的角度

source: The angle to rotate around the x-axis (in degrees °).
zh_cn: 围绕x轴旋转的角度(以度为单位)。

source: The angle to rotate around the y-axis (in degrees °).
zh_cn: 围绕y轴旋转的角度(以度为单位)。

source: The angle to rotate around the z-axis (in degrees °).
zh_cn: 围绕z轴旋转的角度(以度为单位)。

source: The angle to set the for the camera view(from 0° - 360°, default is 0).
zh_cn: 为相机视图设置的角度(从0 - 360，默认为0)。

source: The animation frame to draw (from 0 to image_number - 1).
zh_cn: 要绘制的动画帧(从0到image_number - 1)。

source: The animation name to get the frames of.
zh_cn: 获取帧的动画名。

source: The animation speed type can be any one of the following constants:
zh_cn: 动画速度类型可以是下列常量之一:

source: The animation track to clear.
zh_cn: 要清除的动画轨道。

source: The animation track to get the frame of.
zh_cn: 动画轨道得到的帧。

source: The animation track to set the frame of.
zh_cn: 要设置帧的动画轨迹。

source: The animation track.
zh_cn: 动画的轨道。

source: The anti-aliasing value to use from 0 to 1.
zh_cn: 使用从 0 到 1 的抗锯齿值。

source: The argument to check.
zh_cn: 要检查的参数。

source: The arguments to be passed to the callback
zh_cn: 要传递给回调的参数

source: The array containing the arguments for the function/script
zh_cn: 包含函数/脚本参数的数组

source: The array to append the DS map keys to.
zh_cn: 要向其追加DS map键的数组。

source: The array to append the DS map values to.
zh_cn: 要向其追加DS map值的数组。

source: The aspect ratio of the field of view.
zh_cn: 视场的长宽比。

source: The asset browser ID (index) of the animation curve to get.
zh_cn: 要获取的动画曲线的资源浏览器ID(index)。

source: The attributes give the additional files you want to see, so the normal files are always returned when they satisfy the mask.
zh_cn: 这些属性给出了您想要查看的附加文件，因此当正常文件满足掩码时，它们总是会被返回。

source: The attributes to check for.
zh_cn: 要检查的属性。

source: The audio bus to link the emitter to.
zh_cn: 要连接发射器的音频总线。

source: The audio bus whose emitters should be returned.
zh_cn: 应返回其发射器的音频总线。

source: The available anti-aliasing levels are 0,2,4 and 8, with the default startup value being set to 0, and the default v-sync setting is false (off).
zh_cn: 可用的抗锯齿级别为0、2、4和8，默认启动值设置为0，默认垂直同步设置为false(关)。

source: The available asset types are listed in the table below:
zh_cn: 可用的资源类型如下表所示:

source: The available commands are as follows:
zh_cn: 可选命令如下:

source: The available constants for distribution shapes are listed below:
zh_cn: 下面列出了分布形状的可用常量:

source: The available matrices are view, projection and world, for which you would use one of the following constants:
zh_cn: 可用的矩阵是视图，投影和世界，你可以使用以下常量之一:

source: The available matrix types are view, projection and world, for which you would use one of the following constants:
zh_cn: 可用的矩阵类型是view, projection和world，对此你可以使用以下常量之一:

source: The available option string will depend on the platform that the project is being run on, as listed below:
zh_cn: 可用的选项字符串将取决于项目运行的平台，如下所示:

source: The available values are expressed using the following constants:
zh_cn: 可用值使用以下常量表示:

source: The available values to use are defined by the data type constant that you choose, listed below:
zh_cn: 要使用的可用值由您选择的数据类型常量定义，如下所示:

source: The axis index to check (see the constants list).
zh_cn: 要检查的轴索引(请参阅常量列表)。

source: The background element image will be replaced with the new sprite.
zh_cn: 背景元素图像将被替换为新的精灵。

source: The base alpha to use for the particle group.
zh_cn: 用于粒子组的基础alpha。

source: The base alpha to use for the particle.
zh_cn: 用于粒子的基础alpha。

source: The base colour to use for the particle group.
zh_cn: 用于粒子组的基色。

source: The base colour to use for the particle.
zh_cn: 用于粒子的基色。

source: The base position to seek.
zh_cn: 要寻找的基本位置。

source: The base primitive type is only used for assigning the order in which the vertexes that you stored in the buffer are drawn and connected, but the actual data used for each of the vertexes will be that which you defined when creating the vertex buffer.
zh_cn: 基本图元类型仅用于指定存储在缓冲区中的顶点的绘制和连接顺序，但是用于每个顶点的实际数据将是您在创建顶点缓冲区时定义的数据。

source: The base64 encoded string to decode
zh_cn: 要解码的base64编码字符串

source: The base64 encoded string to decode.
zh_cn: 要解码的base64编码字符串。

source: The beginning of a drag gesture has been detected anywhere in the room
zh_cn: 在房间的任何地方都检测到拖动手势的开始

source: The beginning of a drag gesture has been detected for an instance
zh_cn: 已经检测到一个实例的拖放动作的开始

source: The bit-mask data to set for the listeners
zh_cn: 要为侦听器设置的位掩码数据

source: The bitmask data to set for the sound
zh_cn: 要为声音设置的位掩码数据

source: The blend mode to use (see the table above)
zh_cn: 要使用的混合模式(参见上表)

source: The blue component of the colour
zh_cn: 颜色的蓝色成分

source: The border (in pixels) for the view camera along the horizontal axis
zh_cn: 视图相机沿水平轴的边界(像素)

source: The border (in pixels) for the view camera along the vertical axis
zh_cn: 视图相机沿垂直轴的边界(像素)

source: The bottom cell row of the region.
zh_cn: 区域的底部单元格行。

source: The bottom edge of the rectangle to check.
zh_cn: 要检查的矩形的下边缘。

source: The bottom edge slice
zh_cn: 切片底边边缘

source: The bottom of the bounding box.
zh_cn: 边界框的底部。

source: The bottom position of the region of cells to copy from the source grid.
zh_cn: 要从源网格复制的单元格区域的底部位置。

source: The bounding box index to get the values of.
zh_cn: 要获取其值的边框索引。

source: The buffer ID of the buffer to load the map data from.
zh_cn: 要从其中加载map数据的缓冲区的缓冲区ID。

source: The buffer ID value.
zh_cn: 缓冲区ID值。

source: The buffer can then be used to store different types of data (specified when you write to the buffer using the buffer_write() function, with the following constants being used to define the buffer type:
zh_cn: 然后，缓冲区可用于存储不同类型的数据(在使用buffer_write()函数写入缓冲区时指定，以下常量用于定义缓冲区类型:

source: The buffer created is a special grow buffer which is pre-formatted with the vertex format for building primitives for use with (for example) shaders.
zh_cn: 创建的缓冲区是一个特殊的增长缓冲区，它是用顶点格式预格式化的，用于构建用于(例如)着色器的图元。

source: The buffer id to load from.
zh_cn: 要从中加载的缓冲区id。

source: The buffer id to save to.
zh_cn: 要保存到的缓冲区id。

source: The buffer is pre-formatted with the vertex format for building primitives for use with (for example) shaders, and you can also supply an offset within the source buffer to copy from and the number of vertices that the final buffer should have.
zh_cn: 缓冲区是用顶点格式预格式化的，用于构建用于(例如)着色器的图元，你也可以在源缓冲区中提供一个要复制的偏移量，以及最终缓冲区应该具有的顶点数量。

source: The buffer must have been created previously and should be a 1-byte aligned buffer large enough to store data for the surface you are going to write (if unsure, use a grow buffer or see the example at the bottom of this page).
zh_cn: 这个缓冲区必须是以前创建的，并且应该是一个1字节对齐的缓冲区，足够大，可以为将要写入的表面存储数据(如果不确定，可以使用增长缓冲区，或者查看本页底部的示例)。

source: The buffer to add to the queue.
zh_cn: 要添加到队列的缓冲区。

source: The buffer to be removed.
zh_cn: 要删除的缓冲区。

source: The buffer to be written to.
zh_cn: 要写入的缓冲区。

source: The buffer to create the vertex buffer from.
zh_cn: 用于创建顶点缓冲区的缓冲区。

source: The buffer to end writing to.
zh_cn: 要结束写入的缓冲区。

source: The buffer to freeze.
zh_cn: 要冻结的缓冲区。

source: The buffer to get the size of.
zh_cn: 要获取其大小的缓冲区。

source: The buffer to use.
zh_cn: 要使用的缓冲区。

source: The buffer to write the information to.
zh_cn: 要将信息写入的缓冲区。

source: The buffer used must have been created previously using the function buffer_create(), and should be of the "grow" type, with the size being approximately that of the expected return data.
zh_cn: 使用的缓冲区必须是以前使用buffer_create()函数创建的，并且应该是"grow"类型的，大小大约是预期返回数据的大小。

source: The buffer will have been created previously (see the buffer functions for details on how to do this), and have had data added or loaded into it.
zh_cn: 该缓冲区是之前已经创建好的(关于如何创建的详细信息，请参见缓冲区函数)，并且已经向其中添加或是加载的数据。

source: The button of the device that is being checked.
zh_cn: 正在检查的设备的按钮。

source: The byte alignment for the buffer
zh_cn: 缓冲区的字节对齐方式

source: The callback to be invoked
zh_cn: 要调用的回调

source: The callback to be invoked when the time source expires
zh_cn: 时间源过期时要调用的回调

source: The calling convention used
zh_cn: 使用的调用约定

source: The camera will be created using the values that you set in this function for position, size and other details which correlate to the values you set in the Room Editor (see here).
zh_cn: 将使用您在此函数中为位置、大小和其他细节设置的值来创建相机，这些值与您在房间编辑器中设置的值相关(参见此处)。

source: The caption for the window.
zh_cn: 窗口上的文字说明。

source: The category value is that which you defined in the function physics_particle_create() or (if you created a group) physics_particle_group_begin(), while the flags are the return value of a combination of the following constants:
zh_cn: 类别值是你在函数physics_particle_create()或(如果你创建了一个组)physics_particle_group_begin()中定义的值，而标志是以下常量组合的返回值:

source: The cell (grid) position to set along the x-axis
zh_cn: 要沿x轴设置的单元格(网格)位置

source: The cell (grid) position to set along the y-axis
zh_cn: 要沿y轴设置的单元格(网格)位置

source: The cell along the x-axis to get the tile data from
zh_cn: 获取平铺数据的单元格

source: The cell along the y-axis to get the tile data from
zh_cn: 获取平铺数据的单元格

source: The center colour.
zh_cn: 中心的颜色。

source: The centre slice
zh_cn: 切片中心

source: The chain of audio effects on the bus.
zh_cn: 总线上的音响效果链

source: The channel name (a string) or the channel index (an integer).
zh_cn: 通道名(字符串)或通道索引(整数)。

source: The channel name (a string).
zh_cn: 通道名称 (一个字符串).

source: The channels to use from one of the constants listed below.
zh_cn: 下面列出的其中一个常量要使用的通道。

source: The circle's radius (length from its center to its edge)
zh_cn: 圆的半径(从圆心到边缘的长度)

source: The code example below shows how this works.
zh_cn: 下面的代码示例展示了这是如何工作的。

source: The color to check
zh_cn: 要检查的颜色

source: The color to use.
zh_cn: 要使用的颜色。

source: The colour and alpha value (hexadecimal).
zh_cn: 颜色和透明度(Alpha)值(十六进制)。

source: The colour at the center of the circle.
zh_cn: 圆心的颜色。

source: The colour at the edge of the circle.
zh_cn: 圆圈边缘的颜色。

source: The colour blending for the particles.
zh_cn: 粒子的混合颜色。

source: The colour blending the part should be drawn with.
zh_cn: 绘制部分时应采用的颜色混合。

source: The colour for the bottom left of the drawn text.
zh_cn: 绘制文本左下方的颜色。

source: The colour for the bottom right of the drawn text.
zh_cn: 绘制文本右下方的颜色。

source: The colour for the top left of the drawn text.
zh_cn: 绘制文本左上角的颜色。

source: The colour for the top right of the drawn text.
zh_cn: 绘制文本的右上角的颜色。

source: The colour for this vertex (can be a constant or a hex value).
zh_cn: 这个顶点的颜色(可以是常量或十六进制值)。

source: The colour of the background for the bar
zh_cn: 条形图背景的颜色

source: The colour of the bar when at full health (100)
zh_cn: 完全健康时条的颜色(100)

source: The colour of the bar when at no health (0)
zh_cn: 不健康时条形的颜色(0)

source: The colour of the bottom left corner of the surface.
zh_cn: 表面左下角的颜色。

source: The colour of the bottom left corner.
zh_cn: 左下角的颜色。

source: The colour of the bottom right corner of the surface.
zh_cn: 表面右下角的颜色。

source: The colour of the bottom right corner.
zh_cn: 右下角的颜色。

source: The colour of the center.
zh_cn: 中心的颜色。

source: The colour of the edge.
zh_cn: 边缘的颜色。

source: The colour of the effect.
zh_cn: 效果的颜色。

source: The colour of the end of the line.
zh_cn: 线条末端的颜色。

source: The colour of the first corner.
zh_cn: 第一个角的颜色。

source: The colour of the point.
zh_cn: 点的颜色。

source: The colour of the second corner.
zh_cn: 第二个角的颜色。

source: The colour of the start of the line.
zh_cn: 线条起点的颜色。

source: The colour of the text and the alpha are governed by the current base alpha and colour values as set by draw_set_alpha() and draw_set_colour().
zh_cn: 文本的颜色和alpha值由当前的基本alpha值和由draw_set_alpha()和draw_set_color()设置的颜色值控制。

source: The colour of the third corner.
zh_cn: 第三个角的颜色。

source: The colour of the top left corner of the surface.
zh_cn: 表面左上角的颜色。

source: The colour of the top left corner.
zh_cn: 左上角的颜色。

source: The colour of the top right corner of the surface.
zh_cn: 表面右上角的颜色。

source: The colour of the top right corner.
zh_cn: 右上角的颜色。

source: The colour settings will over-ride the base colour set with the function draw_set_colour().
zh_cn: 颜色设置将覆盖使用draw_set_colour()函数设置的基本颜色。

source: The colour the particle will be halfway through its lifespan.
zh_cn: 粒子寿命过半时的颜色。

source: The colour the particle will end at.
zh_cn: 粒子将终止的颜色。

source: The colour the particle will start at.
zh_cn: 粒子将开始的颜色。

source: The colour to blend with the background sprite (default is c_white)
zh_cn: 与背景精灵混合的颜色(默认为c_white)

source: The colour to blend with the sprite (default is c_white).
zh_cn: 与精灵混合的颜色(默认为c_white)。

source: The colour to blend with the sprite sprite (default is c_white)
zh_cn: 与精灵精灵混合的颜色(默认为c_white)

source: The colour to blend with the texture at this vertex (-1 or c_white for no blending).
zh_cn: 要与该顶点的纹理混合的颜色(-1或c_white表示不混合)。

source: The colour to check
zh_cn: 要检查颜色

source: The colour to draw this vertex with.
zh_cn: 用来绘制这个顶点的颜色。

source: The colour to set for drawing.
zh_cn: 要为绘图设置的颜色。
